package by.lamaka.lesson1;

public class Task6 {
    /*Создайте переменную типа char и присвойте ей значение ‘a’.
    Прибавить к переменной 1 и выведите значение переменной в консоль.
    Попробуйте преобразовать тип переменной к int и снова вывести в консоль.*/

    public static void main(String[] args) {
        char ch = 'a';
        System.out.println(ch + 1);
        int a = ch;
        System.out.println(a);
    }
}
